Revit 2027 API
ParameterTypeId.EnergyAnalysisSillHeight Property
 "Target Sill Height": Deprecated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisSillHeight { get; }
Public Shared ReadOnly Property EnergyAnalysisSillHeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisSillHeight {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisSillHeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace